; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image2 - mode
	infrared0 - mode
	thermograph1 - mode
	Star4 - direction
	Star8 - direction
	GroundStation3 - direction
	Star1 - direction
	Star2 - direction
	GroundStation10 - direction
	Star9 - direction
	Star5 - direction
	Star7 - direction
	GroundStation0 - direction
	GroundStation6 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 infrared0)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 thermograph1)
	(supports instrument2 image2)
	(calibration_target instrument2 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument3 thermograph1)
	(supports instrument3 infrared0)
	(supports instrument3 image2)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
	(supports instrument5 infrared0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star1)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star16)
	(supports instrument6 infrared0)
	(supports instrument6 thermograph1)
	(supports instrument6 image2)
	(calibration_target instrument6 GroundStation10)
	(calibration_target instrument6 Star2)
	(supports instrument7 image2)
	(supports instrument7 thermograph1)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star5)
	(calibration_target instrument7 Star9)
	(supports instrument8 infrared0)
	(calibration_target instrument8 GroundStation6)
	(calibration_target instrument8 GroundStation0)
	(calibration_target instrument8 Star7)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
)
(:goal (and
	(pointing satellite1 Planet14)
	(pointing satellite3 Star7)
	(have_image Planet11 image2)
	(have_image Phenomenon12 image2)
	(have_image Phenomenon13 thermograph1)
	(have_image Planet14 infrared0)
	(have_image Star15 image2)
	(have_image Star16 infrared0)
	(have_image Phenomenon17 thermograph1)
))

)

; plan
1. (turn_to satellite1 groundstation3 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 9
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 9
3. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 0 of 9
4. (turn_to satellite1 planet11 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet11)
   goals met: 0 of 9
5. (take_image satellite1 planet11 instrument3 image2)
   added: (have_image planet11 image2)
   goals met: 1 of 9
6. (turn_to satellite1 phenomenon17 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon17)
   goals met: 1 of 9
7. (take_image satellite1 phenomenon17 instrument3 thermograph1)
   added: (have_image phenomenon17 thermograph1)
   goals met: 2 of 9
8. (turn_to satellite1 phenomenon13 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 9
9. (take_image satellite1 phenomenon13 instrument3 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 3 of 9
10. (turn_to satellite1 phenomenon12 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 9
11. (take_image satellite1 phenomenon12 instrument3 image2)
   added: (have_image phenomenon12 image2)
   goals met: 4 of 9
12. (turn_to satellite1 star15 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 star15)
   goals met: 4 of 9
13. (take_image satellite1 star15 instrument3 image2)
   added: (have_image star15 image2)
   goals met: 5 of 9
14. (turn_to satellite1 star16 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star16)
   goals met: 5 of 9
15. (take_image satellite1 star16 instrument3 infrared0)
   added: (have_image star16 infrared0)
   goals met: 6 of 9
16. (turn_to satellite1 planet14 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 planet14)
   goals met: 7 of 9
17. (take_image satellite1 planet14 instrument3 infrared0)
   added: (have_image planet14 infrared0)
   goals met: 8 of 9
18. (turn_to satellite3 star7 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 star7)
   goals met: 9 of 9
